{
    "word": "Set",
    "definitions": [
        "Put, lay, or stand (something) in a specified place or position.",
        "Be situated or fixed in a specified place or position.",
        "Represent (a story, play, film, or scene) as happening at a specified time or in a specified place.",
        "Mount a precious stone in (something, typically a piece of jewellery)",
        "Mount (a precious stone) in something.",
        "Arrange (type) as required.",
        "Arrange the type for (a piece of text)",
        "Prepare (a table) for a meal by placing cutlery, crockery, etc. on it in their proper places.",
        "Provide (music) so that a written work can be produced in a musical form.",
        "Move (a bell) so that it rests in an inverted position ready for ringing.",
        "Cause (a hen) to sit on eggs.",
        "Put (a seed or plant) in the ground to grow.",
        "Put (a sail) up in position to catch the wind.",
        "Put or bring into a specified state.",
        "Cause (someone or something) to start doing something.",
        "Instruct (someone) to do something.",
        "Give someone (a task or test) to do.",
        "Establish as (an example) for others to follow, copy, or try to achieve.",
        "Establish (a record)",
        "Decide on and announce.",
        "Fix (a price, value, or limit) on something.",
        "Adjust (a clock or watch), typically to show the right time.",
        "Adjust (an alarm clock) to sound at the required time.",
        "Adjust (a device) so that it performs a particular operation.",
        "Cause (a binary device) to enter the state representing the numeral 1.",
        "Harden into a solid or semi-solid state.",
        "Arrange (the hair) while damp so that it dries in the required style.",
        "Put parts of (a broken or dislocated bone or limb) into the correct position for healing.",
        "(of a bone) be restored to its normal condition by knitting together again after being broken.",
        "(with reference to a person's face) assume or cause to assume a fixed or rigid expression.",
        "(of a hunting dog) adopt a rigid attitude indicating the presence of game.",
        "(of the sun, moon, or another celestial body) appear to move towards and below the earth's horizon as the earth rotates.",
        "(of a tide or current) take or have a specified direction or course.",
        "Start (a fire)",
        "(of blossom or a tree) form into or produce (fruit)",
        "(of fruit) develop from blossom.",
        "(of a plant) produce (seed)",
        "Sit."
    ],
    "parts-of-speech": "Verb"
}