{
    "word": "Strike",
    "definitions": [
        "Hit forcibly and deliberately with one's hand or a weapon or other implement.",
        "Inflict (a blow)",
        "Accidentally hit (a part of one's body) against something.",
        "Come into forcible contact or collision with.",
        "(of a beam or ray of light or heat) fall on (an object or surface)",
        "(in sporting contexts) hit or kick (a ball)",
        "Produce (a musical note) by pressing or hitting a key.",
        "(of a disaster, disease, or other unwelcome phenomenon) occur suddenly and have harmful or damaging effects on.",
        "Carry out an aggressive or violent action, typically without warning.",
        "Kill or seriously incapacitate (someone)",
        "Cause or create a particular strong emotion in (someone)",
        "Cause (someone) to be in a specified state.",
        "(of a thought or idea) come into the mind of (someone) suddenly or unexpectedly.",
        "Cause (someone) to have a particular impression.",
        "Find particularly interesting, noticeable, or impressive.",
        "Be deeply fond of or infatuated with.",
        "(of a clock) indicate the time by sounding a chime or stroke.",
        "(of time) be indicated by a clock sounding a chime or stroke.",
        "Ignite (a match) by rubbing it briskly against an abrasive surface.",
        "Produce (fire or a spark) as a result of friction.",
        "Bring (an electric arc) into being.",
        "(of employees) refuse to work as a form of organized protest, typically in an attempt to obtain a particular concession or concessions from their employer.",
        "Undertake strike action against (an employer)",
        "Cancel, remove, or cross out with or as if with a pen.",
        "Officially remove someone from membership of a professional group.",
        "Abolish a law or regulation.",
        "Make (a coin or medal) by stamping metal.",
        "(in cinematography) make (another print) of a film.",
        "Reach, achieve, or agree to (something involving agreement, balance, or compromise)",
        "(in financial contexts) reach (a figure) by balancing an account.",
        "Form (a committee)",
        "Discover (gold, minerals, or oil) by drilling or mining.",
        "Come to or reach.",
        "Discover or think of, especially unexpectedly or by chance.",
        "Move or proceed vigorously or purposefully.",
        "Start out on a new or independent course or endeavour.",
        "Take down (a tent or the tents of an encampment)",
        "Dismantle (theatrical scenery)",
        "Lower or take down (a flag or sail), especially as a salute or to signify surrender.",
        "Insert (a cutting of a plant) in soil to take root.",
        "(of a plant or cutting) develop roots.",
        "(of a young oyster) attach itself to a bed.",
        "Secure a hook in the mouth of a fish by jerking or tightening the line after it has taken the bait or fly."
    ],
    "parts-of-speech": "Verb"
}