{
    "word": "Break",
    "definitions": [
        "Separate into pieces as a result of a blow, shock, or strain.",
        "Sustain an injury involving the fracture of a bone or bones in a part of the body.",
        "Cause a cut or graze in (the skin)",
        "Make or become inoperative.",
        "(of the amniotic fluid surrounding a fetus) be discharged when the sac is ruptured in the first stages of labour.",
        "Open (a safe) forcibly.",
        "Use (a banknote) to pay for something and receive change out of the transaction.",
        "(of two boxers or wrestlers) come out of a clinch, especially at the referee's command.",
        "Make the first stroke at the beginning of a game of billiards, pool, or snooker.",
        "Unfurl (a flag or sail).",
        "Succeed in deciphering (a code)",
        "Disprove (an alibi).",
        "Interrupt (a continuity, sequence, or course)",
        "Put an end to (a silence) by speaking or making contact.",
        "Make a pause in (a journey)",
        "Stop proceedings in order to have a pause or vacation.",
        "Lessen the impact of (a fall)",
        "Disconnect or interrupt (an electric circuit)",
        "Stop oneself from engaging in (a habitual practice)",
        "Surpass (a record)",
        "Fail to observe (a law, regulation, or agreement)",
        "Fail to continue with (a self-imposed discipline)",
        "Crush the emotional strength, spirit, or resistance of.",
        "(of a person's emotional strength or control) give way.",
        "Destroy the power of (a movement or organization)",
        "Destroy the effectiveness of (a strike), typically by moving in other people to replace the striking workers.",
        "(of the weather) change suddenly, especially after a fine spell.",
        "(of a storm) begin violently.",
        "(of dawn or a day) begin as the sun rises.",
        "(of clouds) move apart and begin to disperse.",
        "(of waves) curl over and dissolve into foam.",
        "(of a person's voice) falter and change tone, due to emotion.",
        "(of a boy's voice) change in tone and register at puberty.",
        "(of a vowel) develop into a diphthong, under the influence of an adjacent sound.",
        "(of prices on the stock exchange) fall sharply.",
        "(of news or a scandal) suddenly become public.",
        "Make bad news known to (someone)",
        "(chiefly of an attacking player or team, or of a military force) make a rush or dash in a particular direction.",
        "(of a bowled cricket ball) change direction on bouncing, due to spin.",
        "(of a ball) rebound unpredictably."
    ],
    "parts-of-speech": "Verb"
}