{
    "word": "Play",
    "definitions": [
        "Engage in activity for enjoyment and recreation rather than a serious or practical purpose.",
        "Engage in (a game or activity) for enjoyment.",
        "Amuse oneself by engaging in imaginative pretence.",
        "Engage in without proper seriousness or understanding.",
        "Treat inconsiderately for one's own amusement.",
        "Fiddle or tamper with.",
        "Used to convey one's irritation at someone's actions or one's failure to understand their motives.",
        "Take part in (a sport)",
        "Participate in (a sporting match or contest)",
        "Compete against (another player or team) in a sporting match.",
        "Be part of a team, especially in a specified position, in a sporting contest.",
        "Strike (a ball) or execute (a stroke) in a game.",
        "(of a cricket ground) be in such condition as to have a specified effect on play.",
        "Assign to take part in a match, especially in a specified position.",
        "Move (a piece) or display (a playing card) in one's turn in a game.",
        "Bet or gamble at or on.",
        "Be cooperative.",
        "Represent (a character) in a theatrical performance or a film.",
        "Perform in a film or theatrical production.",
        "Put on or take part in (a theatrical performance, film, or concert)",
        "Give a dramatic performance at (a particular theatre or place)",
        "Behave as though one were (a specified type of person)",
        "Treat someone as being of (a specified type)",
        "Perform on (a musical instrument)",
        "Possess the skill of performing on (a musical instrument)",
        "Produce (notes) from a musical instrument; perform (a piece of music)",
        "Make (a disc, music player, or other device) produce sounds or recorded images.",
        "(of a musical instrument, music player, or other device) produce sounds or recorded images.",
        "Accompany (someone) with music as they are moving in a specified direction.",
        "Move lightly and quickly, so as to appear and disappear; flicker.",
        "(of a fountain or similar source of water) emit a stream of gently moving water.",
        "Allow (a fish) to exhaust itself pulling against a line before reeling it in."
    ],
    "parts-of-speech": "Verb"
}