{
    "word": "Cover",
    "definitions": [
        "Put something on top of or in front of (something) in order to protect or conceal it.",
        "Envelop in a layer of something, especially dirt.",
        "Scatter a layer of loose material over (a floor or other surface), leaving it obscured.",
        "Lie over or adhere to (a surface), as decoration or to conceal something.",
        "Extend over (an area)",
        "Travel (a specified distance)",
        "Deal with (a subject) by describing or analysing its most important aspects or events.",
        "Investigate, report on, or show pictures of (an event)",
        "Have responsibility for or provide services to (a particular area)",
        "(of a rule or law) apply to (a person or situation)",
        "(of a sum of money) be enough to pay (a cost)",
        "(of insurance) protect against a liability, loss, or accident involving financial consequences.",
        "Take precautionary measures so as to protect oneself against future blame or liability.",
        "Disguise the sound or fact of (something) with another sound or action.",
        "Disguise the illicit absence or wrongdoing of (someone) in order to spare them punishment.",
        "Temporarily take over the job of (a colleague) in their absence.",
        "Aim a gun at (someone) in order to prevent them from moving or escaping.",
        "Protect (an exposed person) by shooting at an enemy.",
        "(of a fortress, gun, or cannon) have (an area) within range.",
        "Stand behind (another player) to stop any missed balls.",
        "(in team games) take up a position ready to defend against (an opposing player).",
        "Be in position at (a base) ready to catch the ball.",
        "Record or perform a new version of (a song) originally performed by someone else.",
        "(of a male animal, especially a stallion) copulate with (a female animal)",
        "Play a higher card on (a high card) in a trick."
    ],
    "parts-of-speech": "Verb"
}