{
    "word": "Mark",
    "definitions": [
        "A small area on a surface having a different colour from its surroundings, typically one caused by damage or dirt.",
        "A spot, area, or feature on a person's or animal's body by which they may be identified or recognized.",
        "A line, figure, or symbol made as an indication or record of something.",
        "A sign or indication of a quality or feeling.",
        "A written symbol made on a document in place of a signature by someone who cannot write.",
        "A competitor's starting point in a race.",
        "A piece of material or a knot used to indicate a depth on a sounding line.",
        "One of two possible states of a signal in certain systems.",
        "A level or stage that is considered significant.",
        "A particular temperature level in a gas oven.",
        "A point awarded for a correct answer or for proficiency in an examination or competition.",
        "A figure or letter representing the total number of marks awarded in an examination or competition and signifying a person's score.",
        "An official assessment of a horse's form, expressed as a figure between 0 and 140 and used as the basis for calculating the weight the horse has to carry in a race.",
        "(especially in athletics) a time or distance achieved by a competitor, especially one which represents a record or personal best.",
        "(followed by a numeral) a particular model or type of a vehicle or machine.",
        "A target.",
        "A person who is easily deceived or taken advantage of.",
        "The act of cleanly catching the ball direct from a kick, knock-on, or forward throw by an opponent, on or behind one's own 22-metre line, and exclaiming ‘Mark’, after which a free kick can be taken by the catcher.",
        "An act of catching a ball that has been kicked at least fifteen metres before it reaches the ground, or the spot from which the subsequent kick is taken."
    ],
    "parts-of-speech": "Noun"
}