{
    "word": "Point",
    "definitions": [
        "The tapered, sharp end of a tool, weapon, or other object.",
        "A pointed flake or blade, especially one that has been worked.",
        "The tip of a person's chin as a spot for a blow.",
        "The prong of a deer's antler.",
        "A dot or other punctuation mark, in particular a full stop.",
        "A decimal point.",
        "A dot or small stroke used in Semitic languages to indicate vowels or distinguish particular consonants.",
        "A very small dot or mark.",
        "A particular spot, place, or position in an area or on a map, object, or surface.",
        "A particular moment in time or stage in a process.",
        "The critical or decisive moment.",
        "The verge or brink of (doing or being something)",
        "A stage or level at which a change of state occurs.",
        "A socket in a wall for connecting a device to an electrical supply or communications network.",
        "(in geometry) something having position but not spatial extent, magnitude, dimension, or direction, for example the intersection of two lines.",
        "A single item or detail in an extended discussion, list, or text.",
        "An argument or idea.",
        "The significant or essential element of something being planned or discussed.",
        "Advantage or purpose that can be gained from doing something.",
        "Relevance or effectiveness.",
        "A distinctive feature or characteristic, typically a good one, of a person or thing.",
        "(in sports and games) a mark or unit of scoring awarded for success or performance.",
        "A unit used in measuring value, achievement, or extent.",
        "An advantage or success in an argument or discussion.",
        "A unit of credit towards an award or benefit.",
        "A percentage of the profits from a film or recording offered to certain people involved in its production.",
        "(in piquet) the longest suit in a player's hand, containing a specified number of up to eight cards.",
        "A unit of weight (2 mg) for diamonds.",
        "A unit of varying value, used in quoting the price of stocks, bonds, or futures.",
        "A value assigned to certain cards (4 points for an ace, 3 for a king, 2 for a queen, and 1 for a jack, sometimes with extra points for long or short suits) by a player in assessing the strength of their hand.",
        "Each of thirty-two directions marked at equal distances round a compass.",
        "A direction towards the horizon corresponding to the direction marked on a compass.",
        "The angular interval between two successive points of a compass, i.e. one eighth of a right angle (11° 15ʹ).",
        "Unspecified places considered in terms of their direction from a specified place.",
        "A narrow piece of land jutting out into the sea.",
        "A junction of two railway lines, with a pair of linked tapering rails that can be moved laterally to allow a train to pass from one line to the other.",
        "A unit of measurement for type sizes and spacing (in the UK and US 0.351 mm, in Europe 0.376 mm).",
        "A fielding position on the off side near the batsman.",
        "A fielder at the point position.",
        "Either of two areas to the left and right of the net, just inside the blue line where it meets the boards.",
        "A position at the front of the court, usually manned by the guard who sets up the team's defence.",
        "(in a motor vehicle) each of a set of electrical contacts in the distributor.",
        "A small leading party of an advanced guard of troops.",
        "The position at the head of a column or wedge of troops.",
        "The extremities of an animal, typically a horse or cat, such as the face, paws, and tail of a Siamese cat.",
        "A spot to which a straight run is made.",
        "A straight run.",
        "A tagged piece of ribbon or cord used for lacing a garment or attaching a hose to a doublet.",
        "A short piece of cord at the lower edge of a sail for tying up a reef.",
        "The action or position of a dog in pointing.",
        "An important phrase or subject, especially in a contrapuntal composition."
    ],
    "parts-of-speech": "Noun"
}