{
    "word": "Cut",
    "definitions": [
        "Make an opening, incision, or wound in (something) with a sharp-edged tool or object.",
        "Make a deliberate incision in (one's flesh), as a symptom of psychological or emotional distress.",
        "Remove (something) from something larger by using a sharp implement.",
        "Castrate (an animal, especially a horse).",
        "Make something by cutting.",
        "Remove, exclude, or stop eating or doing something undesirable.",
        "Separate an animal from the main herd.",
        "Divide into pieces with a knife or other sharp implement.",
        "Make divisions in (something)",
        "Separate (something) into two; sever.",
        "Cause something to fall by cutting it through at the base.",
        "(of a weapon, bullet, or disease) kill or injure someone.",
        "Make or form (something) by using a sharp tool to remove material.",
        "Make or design (a garment) in a particular way.",
        "Make (a path, tunnel, or other route) by excavation, digging, or chopping.",
        "Make (a sound recording)",
        "Trim or reduce the length of (grass, hair, etc.) by using a sharp implement.",
        "Reduce the amount or quantity of.",
        "Abridge (a text, film, or performance) by removing material.",
        "Delete (part of a text or other display) so as to insert a copy of it elsewhere.",
        "End or interrupt the provision of (a supply)",
        "Switch off (an engine or a light)",
        "Absent oneself from (something one should normally attend, especially school)",
        "Ignore or refuse to recognize (someone)",
        "(of a line) cross or intersect (another line)",
        "Pass or traverse, especially so as to shorten one's route.",
        "Have an effect regardless of (divisions or boundaries between groups)",
        "Leave or move hurriedly.",
        "Stop filming or recording.",
        "Move to another shot in a film.",
        "Make (a film) into a coherent whole by removing parts or placing them in a different order.",
        "Divide a pack of playing cards by lifting a portion from the top, either to reveal a card at random or to place the top portion under the bottom portion.",
        "Strike or kick (a ball) with an abrupt, typically downward motion.",
        "Slice (the ball).",
        "Hit (the ball) to the off side with the bat held almost horizontally; play such a stroke against (the bowler).",
        "(of the ball) turn sharply on pitching.",
        "Mix (an illegal drug) with another substance.",
        "Come up to expectations; meet requirements."
    ],
    "parts-of-speech": "Verb"
}