{
    "word": "Plate",
    "definitions": [
        "A flat dish, typically circular and made of china, from which food is eaten or served.",
        "An amount of food on a plate.",
        "A main course of a meal, served on one plate.",
        "A plate of food contributed by a guest to a social gathering.",
        "A flat dish, typically made of metal or wood, passed round a church congregation in order to collect donations of money.",
        "A shallow glass dish on which a culture of cells or microorganisms may be grown.",
        "Dishes, bowls, cups, and other utensils made of gold, silver, or other metal.",
        "A silver or gold dish or trophy awarded as a prize in a race or competition.",
        "A race or competition in which a silver or gold dish or trophy is awarded.",
        "A thin, flat sheet or strip of metal or other material, typically one used to join or strengthen things or forming part of a machine.",
        "A small, flat piece of metal or other material bearing a name or inscription and attached to a door or other object.",
        "A horizontal timber laid along the top of a wall to support the ends of joists or rafters.",
        "A light horseshoe for a racehorse.",
        "A thin, flat organic structure or formation.",
        "Each of the several rigid pieces of the earth's lithosphere which together make up the earth's surface.",
        "A sheet of metal, plastic, or other material bearing an image of type or illustrations from which multiple copies are printed.",
        "A printed photograph, picture, or illustration, especially one on superior-quality paper in a book.",
        "A thin sheet of metal, glass, or other substance coated with a light-sensitive film on which an image is formed, used in larger or older types of camera.",
        "A thin piece of plastic moulded to the shape of a person's mouth and gums, to which artificial teeth or another orthodontic appliance are attached.",
        "A complete denture or orthodontic appliance.",
        "A thin piece of metal that acts as an electrode in a capacitor, battery, or cell.",
        "The anode of a thermionic valve."
    ],
    "parts-of-speech": "Noun"
}