{
    "word": "Set",
    "definitions": [
        "A group or collection of things that belong together or resemble one another or are usually found together.",
        "A collection of implements, containers, or other objects customarily used together.",
        "A group of people with common interests or occupations or of similar social status.",
        "A group of pupils or students of the same average ability in a particular subject who are taught together.",
        "(in tennis, darts, and other games) a group of games counting as a unit towards a match.",
        "(in jazz or popular music) a sequence of songs or pieces performed together and constituting or forming part of a live show or recording.",
        "A group of people making up the required number for a square dance or similar country dance.",
        "A fixed number of repetitions of a particular bodybuilding exercise.",
        "A collection of distinct entities regarded as a unit, being either individually specified or (more usually) satisfying specified conditions.",
        "The way in which something is set, disposed, or positioned.",
        "The posture or attitude of a part of the body, typically in relation to the impression this gives of a person's feelings or intentions.",
        "A grudge.",
        "The flow of a current or tide in a particular direction.",
        "The inverted position of a bell when it is ready for ringing.",
        "A setter's pointing in the presence of game.",
        "The inclination of the teeth of a saw in alternate directions.",
        "A warp or bend in wood, metal, or another material caused by continued strain or pressure.",
        "A radio or television receiver.",
        "A collection of scenery, stage furniture, and other articles used for a particular scene in a play or film.",
        "The place or area in which filming is taking place or a play is performed.",
        "An arrangement of the hair when damp so that it dries in the required style.",
        "A cutting, young plant, or bulb used in the propagation of new plants.",
        "A young fruit that has just formed.",
        "The last coat of plaster on a wall.",
        "The amount of spacing in type controlling the distance between letters.",
        "The width of a piece of type."
    ],
    "parts-of-speech": "Noun"
}