{
    "word": "Stock",
    "definitions": [
        "The goods or merchandise kept on the premises of a shop or warehouse and available for sale or distribution.",
        "A supply or quantity of something accumulated or available for future use.",
        "Farm animals such as cattle, pigs, and sheep, bred and kept for their meat or milk; livestock.",
        "Photographic film that has not been exposed or processed.",
        "(in some card games) the cards that have not yet been dealt, left on the table to be drawn.",
        "The capital raised by a company or corporation through the issue and subscription of shares.",
        "A portion of a company's stock as held by an individual or group as an investment.",
        "The shares of a particular company, type of company, or industry.",
        "(in the UK) securities issued by the government in fixed units with a fixed rate of interest.",
        "A person's reputation or popularity.",
        "Liquid made by cooking bones, meat, fish, or vegetables slowly in water, used as a basis for the preparation of soup, gravy, or sauces.",
        "The raw material from which a specified commodity can be manufactured.",
        "A person's ancestry or line of descent.",
        "A breed, variety, or population of an animal or plant.",
        "The trunk or woody stem of a living tree or shrub, especially one into which a graft (scion) is inserted.",
        "The perennial part of a herbaceous plant, especially a rhizome.",
        "A herbaceous European plant that is cultivated for its fragrant lilac, pink, or white flowers.",
        "An instrument of punishment consisting of an adjustable wooden structure with holes for securing a person's feet and hands, in which criminals were locked and exposed to public ridicule or assault.",
        "The part of a rifle or other firearm to which the barrel and firing mechanism are attached, held against one's shoulder when firing the gun.",
        "The crossbar of an anchor.",
        "The handle of something such as a whip or fishing rod.",
        "A band of white material tied like a cravat and worn as a part of formal horse-riding dress.",
        "A piece of black material worn under a clerical collar.",
        "A frame used to support a ship or boat out of water, especially when under construction."
    ],
    "parts-of-speech": "Noun"
}