{
    "word": "Take",
    "definitions": [
        "Lay hold of (something) with one's hands; reach for and hold.",
        "Capture or gain possession of by force or military means.",
        "(in bridge, whist, and similar card games) win (a trick)",
        "Capture (an opposing piece or pawn)",
        "Dismiss a batsman from (his wicket)",
        "Dispossess someone of (something); steal or illicitly remove.",
        "Occupy (a place or position)",
        "Rent (a house)",
        "Agree to buy (an item)",
        "(of a person) already be married or in an emotional relationship.",
        "Use or have ready to use.",
        "Use as an instance or example in support of an argument.",
        "Regularly buy or subscribe to (a particular newspaper or periodical).",
        "Ascertain by measurement or observation.",
        "Write down.",
        "Make (a photograph) with a camera.",
        "(especially of illness) suddenly strike or afflict (someone)",
        "Have sexual intercourse with.",
        "Remove (someone or something) from a particular place.",
        "Subtract.",
        "Carry or bring with one; convey.",
        "Accompany or guide (someone) to a specified place.",
        "Bring into a specified state.",
        "Use as a route or a means of transport.",
        "Accept or receive (someone or something)",
        "Understand or accept as valid.",
        "Acquire or assume (a position, state, or form)",
        "Receive (a specified amount of money) as payment or earnings.",
        "Achieve or attain (a victory or result)",
        "Act on (an opportunity)",
        "Experience or be affected by.",
        "React to or regard (news or an event) in a specified way.",
        "Deal with (a physical obstacle or course) in a specified way.",
        "Regard or view in a specified way.",
        "Be attracted or charmed by.",
        "Submit to, tolerate, or endure.",
        "Assume.",
        "Consume as food, drink, medicine, or drugs.",
        "Make, undertake, or perform (an action or task)",
        "Conduct (a ceremony or gathering).",
        "Be taught or examined in (a subject)",
        "Obtain (an academic degree) after fulfilling the required conditions.",
        "Require or use up (a specified amount of time)",
        "(of a task or situation) need or call for (a particular person or thing)",
        "Hold; accommodate.",
        "Wear or require (a particular size of garment or type of complementary article)",
        "(of a plant or seed) take root or begin to grow; germinate.",
        "(of an added substance) become successfully established.",
        "Have or require as part of the appropriate construction."
    ],
    "parts-of-speech": "Verb"
}