{
    "word": "Side",
    "definitions": [
        "A position to the left or right of an object, place, or central point.",
        "Either of the two halves of an object, surface, or place regarded as divided by an imaginary central line.",
        "The right or the left part of a person's or animal's body, especially of the human torso.",
        "A place or position closely adjacent to someone.",
        "Either of the lateral halves of the body of a butchered animal, or of an animal prepared for eating.",
        "An upright or sloping surface of a structure or object that is not the top or bottom and generally not the front or back.",
        "The part of the hull of a boat extending from stem to stern between the gunwale and the waterline.",
        "Each of the flat surfaces of a solid object.",
        "Either of the two surfaces of something flat and thin, such as paper.",
        "The amount of writing needed to fill one side of a sheet of paper.",
        "Either of the two faces of a record or of the two separate tracks on a length of recording tape.",
        "A part or region near the edge and away from the middle of something.",
        "Each of the lines forming the boundary of a plane rectilinear figure.",
        "A person or group opposing another or others in a dispute, contest, or debate.",
        "A sports team.",
        "The position, interests, or attitude of one person or group, especially when regarded as being in opposition to another or others.",
        "A particular aspect of a situation or a person's character.",
        "A person's kinship or line of descent as traced through either their father or mother.",
        "A television channel considered as one of two or more that are available.",
        "Subsidiary to or less important than something.",
        "A dish served as subsidiary to the main one.",
        "Horizontal spinning motion given to a ball.",
        "Spin given to the cue ball in snooker and billiards by hitting it on one side.",
        "Boastful or pretentious manner or attitude.",
        "Either of a pair of things."
    ],
    "parts-of-speech": "Noun"
}