{
    "word": "Head",
    "definitions": [
        "The upper part of the human body, or the front or upper part of the body of an animal, typically separated from the rest of the body by a neck, and containing the brain, mouth, and sense organs.",
        "The head regarded as the location of intellect, imagination, and memory.",
        "An aptitude for or tolerance of.",
        "A headache, especially one resulting from intoxication.",
        "The height or length of a head as a measure.",
        "The side of a coin bearing the image of a head (used when tossing a coin to determine a winner)",
        "The antlers of a deer.",
        "A thing resembling a head either in form or in relation to a whole.",
        "The cutting, striking, or operational end of a tool, weapon, or mechanism.",
        "The flattened or knobbed end of a nail, pin, screw, or match.",
        "The ornamented top of a pillar or column.",
        "A compact mass of leaves or flowers at the top of a stem, especially a capitulum.",
        "The edible leafy part at the top of the stem of such green vegetables as cabbage and lettuce.",
        "The front, forward, or upper part or end of something.",
        "The upper end of a table or bed.",
        "The upper horizontal part of a window frame or door frame.",
        "The flat end of a cask or drum.",
        "The front of a queue or procession.",
        "The top of a page.",
        "The top of a flight of stairs or steps.",
        "The foam on top of a glass of beer, or the cream on the top of milk.",
        "The source of a river or stream.",
        "The end of a lake or inlet at which a river enters.",
        "A promontory.",
        "The top of a ship's mast.",
        "The bows of a ship.",
        "A person in charge of something; a director or leader.",
        "A person considered as a numerical unit.",
        "A number of cattle or game as specified.",
        "A component in an audio, video, or information system by which information is transferred from an electrical signal to the recording medium, or vice versa.",
        "The part of a record player that holds the playing cartridge and stylus.",
        "A body of water kept at a particular height in order to provide a supply at sufficient pressure.",
        "The pressure exerted by a head of water or by a confined body of steam.",
        "A toilet on a ship or boat.",
        "The word that governs all the other words in a phrase in which it is used, having the same grammatical function as the whole phrase.",
        "A superficial deposit of rock fragments, formed at the edge of an ice sheet by repeated freezing and thawing and then moved downhill.",
        "A group of pheasants."
    ],
    "parts-of-speech": "Noun"
}