{
    "word": "Hold",
    "definitions": [
        "Grasp, carry, or support with one's arms or hands.",
        "Keep or sustain in a specified position.",
        "Embrace (someone)",
        "Be able to bear (the weight of a person or thing)",
        "(of a vehicle) maintain close contact with (the road), especially when driven at speed.",
        "(of a ship or an aircraft) continue to follow (a particular course)",
        "Keep going in a particular direction.",
        "Keep or detain (someone)",
        "Keep possession of (something), typically in the face of a challenge or attack.",
        "Keep (someone's interest or attention).",
        "(of a singer or musician) sustain (a note).",
        "Stay or cause to stay at a certain value or level.",
        "(in sport) manage to achieve a draw against (opponents thought likely to win)",
        "Remain secure, intact, or in position without breaking or giving way.",
        "(of a favourable condition or situation) continue without changing.",
        "Be or remain valid or available.",
        "(of an argument or theory) be logical, consistent, or convincing.",
        "Refuse to abandon or change (a principle or opinion)",
        "Cause someone to adhere to (a commitment)",
        "Contain or be capable of containing (a specified amount)",
        "Be able to drink (a reasonable amount of alcohol) without becoming drunk or suffering any ill effects.",
        "Have or be characterized by.",
        "Have in one's possession.",
        "Be in possession of illegal drugs.",
        "Have or occupy (a job or position)",
        "Have (a belief or opinion)",
        "Consider (someone) to be responsible or liable for a particular situation.",
        "Regard someone or something with (a specified feeling)",
        "(of a judge or court) rule; decide.",
        "Keep or reserve for someone.",
        "Maintain (a telephone connection) until the person one has telephoned is free to speak.",
        "Prevent from going ahead or occurring.",
        "Refrain from adding or using (something, typically an item of food or drink)",
        "Wait or stop doing something.",
        "Restrain oneself.",
        "Arrange and take part in (a meeting or conversation)"
    ],
    "parts-of-speech": "Verb"
}