{
    "word": "Open",
    "definitions": [
        "Allowing access, passage, or a view through an empty space; not closed or blocked.",
        "(of a container) not fastened or sealed.",
        "(of a garment or its fastenings) not done up.",
        "(of the mouth or eyes) with lips or lids parted.",
        "(of a fabric) loosely knitted or woven.",
        "(of the bowels) not constipated.",
        "Exposed to the air or to view; not covered.",
        "(of land) not covered with buildings or trees.",
        "Damaged by a deep cut in the surface.",
        "Likely to suffer from or be affected by; vulnerable or subject to.",
        "(of a goalmouth or other object of attack in a game) unprotected by defenders.",
        "(of a town or city) officially declared to be undefended, and so immune under international law from bombardment.",
        "With the outer edges or sides drawn away from each other; unfolded or spread out.",
        "(of a book or file) with the covers parted allowing it to be read.",
        "(of a hand) not clenched into a fist.",
        "(of a business, place of entertainment, etc.) admitting customers or visitors; available for business.",
        "(of a bank account) available for transactions.",
        "(of a telephone line) ready to take calls.",
        "Freely available or accessible; unrestricted.",
        "(of an offer or opportunity) still available.",
        "With no restrictions on those allowed to participate.",
        "(of a victor) having won an open competition.",
        "(of a ticket) not restricted as to day of travel.",
        "(of a cheque) not crossed.",
        "(of a set) not containing any of its limit points.",
        "Not concealing one's thoughts or feelings; frank and communicative.",
        "Not concealed.",
        "(of conflict) fully developed and unconcealed.",
        "Welcoming public discussion, criticism, and enquiry.",
        "(of a game or style of play) characterized by action which is spread out over the field.",
        "(of a matter or decision) not finally settled; still admitting of debate.",
        "(of the mind) accessible to new ideas.",
        "Receptive to.",
        "Admitting of; making possible.",
        "(of a vowel) produced with a relatively wide opening of the mouth and the tongue kept low.",
        "(of a syllable) ending in a vowel.",
        "(of a string) allowed to vibrate along its whole length.",
        "(of a pipe) unstopped at each end.",
        "(of a note) sounded from an open string or pipe.",
        "(of an electric circuit) having a break in the conducting path."
    ],
    "parts-of-speech": "Adjective"
}