{
    "word": "Order",
    "definitions": [
        "The arrangement or disposition of people or things in relation to each other according to a particular sequence, pattern, or method.",
        "A state in which everything is in its correct or appropriate place.",
        "A state in which the laws and rules regulating public behaviour are observed and authority is obeyed.",
        "The prescribed or established procedure followed by a meeting, legislative assembly, debate, or court of law.",
        "A stated form of liturgical service, or of administration of a rite, prescribed by ecclesiastical authority.",
        "An authoritative command or instruction.",
        "A verbal or written request for something to be made, supplied, or served.",
        "A thing made, supplied, or served as a result of an order.",
        "A written direction of a court or judge.",
        "A written direction to pay money or deliver property.",
        "A particular social, political, or economic system.",
        "A social class.",
        "A rank in the Christian ministry, especially that of bishop, priest, or deacon.",
        "The rank of a member of the clergy or an ordained minister of the Church.",
        "Any of the nine grades of angelic beings in the celestial hierarchy as formulated by Pseudo-Dionysius.",
        "A society of monks, nuns, or friars living under the same religious, moral, and social regulations and discipline.",
        "A society of knights bound by a common rule of life and having a combined military and monastic character.",
        "An institution founded by a monarch along the lines of a medieval crusading monastic order for the purpose of honouring meritorious conduct.",
        "The insignia worn by members of an order of honour or merit.",
        "A Masonic or similar fraternity.",
        "The quality or nature of something.",
        "The overall state or condition of something.",
        "A principal taxonomic category that ranks below class and above family.",
        "Any of the five classical styles of architecture (Doric, Ionic, Corinthian, Tuscan, and Composite) based on the proportions of columns and the style of their decoration.",
        "Any style of architecture subject to uniform established proportions.",
        "Equipment or uniform for a specified purpose or of a specified type.",
        "The position in which a rifle is held after ordering arms.",
        "The degree of complexity of an equation, expression, etc., as denoted by an ordinal number.",
        "The number of differentiations required to reach the highest derivative in a differential equation.",
        "The number of elements in a finite group.",
        "The number of rows or columns in a square matrix."
    ],
    "parts-of-speech": "Noun"
}