{
    "word": "Line",
    "definitions": [
        "A long, narrow mark or band.",
        "A straight or curved continuous extent of length without breadth.",
        "A direct course.",
        "A furrow or wrinkle in the skin, especially on the face.",
        "A contour or outline considered as a feature of design or composition.",
        "(on a map or graph) a curve connecting all points having a specified common property.",
        "A line marking the starting or finishing point in a race.",
        "(in football, hockey, etc.) the goal line.",
        "The equator.",
        "A notional limit or boundary.",
        "Each of the very narrow horizontal sections forming a television picture.",
        "A narrow range of the spectrum that is noticeably brighter or darker than the adjacent parts.",
        "The level of the base of most letters, such as h and x, in printing and writing.",
        "Denoting an image consisting of lines and solid areas, with no gradation of tone.",
        "Each of (usually five) horizontal lines forming a stave in musical notation.",
        "A sequence of notes or tones forming an instrumental or vocal melody.",
        "A dose of a powdered narcotic drug, especially cocaine, laid out in a line ready to be taken.",
        "A length of cord, rope, wire, or other material serving a particular purpose.",
        "A length of sterile tubing inserted into a vein or artery in order to provide temporary access, typically so as to administer fluids or withdraw blood.",
        "A telephone connection or service.",
        "A railway track.",
        "A branch or route of a railway system.",
        "A company that provides ships, aircraft, or buses on particular routes on a regular basis.",
        "A horizontal row of written or printed words.",
        "A part of a poem or song forming one row of written or printed words.",
        "The words of an actor's part in a play or film.",
        "An amount of text or number of repetitions of a sentence written out as a school punishment.",
        "A row of people or things.",
        "A queue.",
        "A connected series of people following one another in time (used especially of several generations of a family)",
        "A series of related things.",
        "A range of commercial goods.",
        "An area or branch of activity.",
        "A direction, course, or channel.",
        "A manner of doing or thinking about something.",
        "An agreed approach; a policy.",
        "A false or exaggerated remark or story.",
        "A connected series of military fieldworks or defences facing an enemy force.",
        "An arrangement of soldiers or ships in a column or line formation; a line of battle.",
        "Regular army regiments (as opposed to auxiliary forces or household troops)."
    ],
    "parts-of-speech": "Noun"
}