{
    "word": "Key",
    "definitions": [
        "A small piece of shaped metal with incisions cut to fit the wards of a particular lock, which is inserted into a lock and turned to open or close it.",
        "A shaped metal implement for operating a switch in the form of a lock, especially one operating the ignition of a motor vehicle.",
        "An instrument for grasping and turning a screw, peg, or nut, especially one for winding a clock or turning a valve.",
        "A pin, bolt, or wedge inserted into a hole or between parts so as to lock the parts together.",
        "Each of several buttons on a panel for operating a computer, typewriter, or telephone.",
        "A lever depressed by the finger in playing an instrument such as the organ, piano, flute, or concertina.",
        "A lever operating a mechanical device for making or breaking an electric circuit, for example in telegraphy.",
        "A thing that provides a means of achieving or understanding something.",
        "An explanatory list of symbols used in a map, table, etc.",
        "A set of answers to exercises or problems.",
        "A word or system for solving a cipher or code.",
        "The first move in the solution of a chess problem.",
        "A field in a record which is used to identify that record uniquely.",
        "A group of notes based on a particular note and comprising a scale, regarded as forming the tonal basis of a piece of music.",
        "The tone or pitch of someone's voice.",
        "The prevailing tone of a piece of writing, situation, etc.",
        "The prevailing range of tones in a painting.",
        "The dry winged fruit of an ash, maple, or sycamore, typically growing in bunches; a samara.",
        "The part of a first coat of wall plaster that passes between the laths and so secures the rest.",
        "The roughness of a surface, helping the adhesion of plaster or other material.",
        "The keyhole-shaped area marked on the court near each basket."
    ],
    "parts-of-speech": "Noun"
}