{
    "word": "Give",
    "definitions": [
        "Freely transfer the possession of (something) to (someone)",
        "Administer (medicine)",
        "Hand over (an amount) in payment; pay.",
        "Used hyperbolically to express how greatly one wants to have or do something.",
        "Commit or entrust.",
        "Freely set aside or devote for a purpose.",
        "(of a man) sanction the marriage of (his daughter) to someone.",
        "(of a woman) consent to have sexual intercourse with (a man)",
        "Used to present a speaker or entertainer or when making a toast.",
        "Cause or allow (someone or something) to have or experience (something); provide with.",
        "Provide (love or other emotional support) to.",
        "Sentence (someone) to (a specified penalty)",
        "Allot (a score) to.",
        "Allow (someone) to have (a specified amount of time) for an activity or undertaking.",
        "Pass on (an illness or infection) to (someone)",
        "Pass (a message) to (someone)",
        "Make a connection to allow (someone) to speak to (someone else) on the telephone.",
        "Carry out or perform (a specified action)",
        "Produce (a sound)",
        "Present (an appearance or impression)",
        "Provide (a party or social meal) as host or hostess.",
        "Yield as a product or result.",
        "Emit odour, vapour, or similar substances.",
        "Concede (something) as valid or deserved in respect of (someone)",
        "Place a specified value on (something)",
        "(of an umpire or referee) declare whether or not (a player) is out or offside.",
        "Adjudicate that (a goal) has been legitimately scored.",
        "State or put forward (information or argument)",
        "Pledge or offer as a guarantee.",
        "Say to (someone) as an excuse or inappropriate answer.",
        "Deliver (a judgement) authoritatively.",
        "Predict that (an activity or relationship) will last no longer than (a specified time)",
        "Tell what one knows.",
        "Alter in shape under pressure rather than resist or break.",
        "Yield or give way to pressure.",
        "Concede defeat; surrender."
    ],
    "parts-of-speech": "Verb"
}