{
    "word": "Go",
    "definitions": [
        "Move from one place to another; travel.",
        "Travel a specified distance.",
        "Travel or move in order to engage in a specified activity.",
        "Attend or visit for a particular purpose.",
        "Be sold or awarded to.",
        "(of a thing) lie or extend in a certain direction.",
        "Change in level, amount, or rank.",
        "Said in various expressions when angrily or contemptuously dismissing someone.",
        "Used to emphasize the speaker's annoyance at someone's action.",
        "Begin motion (used in a starter's order to begin a race)",
        "Leave; depart.",
        "(of time) pass or elapse.",
        "Pass a specified amount of time in a particular way.",
        "Come to an end; cease to exist.",
        "Cease operating or functioning.",
        "Leave or resign from a post.",
        "Die (used euphemistically)",
        "Be lost or stolen.",
        "(of money) be spent, especially in a specified way.",
        "Intend or be likely or intended to be or do something (used to express a future tense)",
        "Pass into or be in a specified state, especially an undesirable one.",
        "Enter into a specified state or course of action.",
        "Make a sound of a specified kind.",
        "(of a bell or similar device) make a sound in functioning.",
        "Proceed or turn out in a specified way.",
        "Be acceptable or permitted.",
        "Be harmonious, complementary, or matching.",
        "Be found in the same place or situation; be associated.",
        "(of a machine or device) function.",
        "Continue in operation or existence.",
        "Contribute to or be put into (a whole)",
        "Used to indicate how many people a supply of a resource is sufficient for or how much can be achieved using it.",
        "(of an article) be regularly kept or put in a particular place.",
        "Fit into a particular place or space.",
        "(of a song or account) have a specified content or wording.",
        "Be known or called by (a specified name)",
        "Say.",
        "Use a toilet; urinate or defecate."
    ],
    "parts-of-speech": "Verb"
}