{
    "word": "Rise",
    "definitions": [
        "Move from a lower position to a higher one; come or go up.",
        "(of the sun, moon, or another celestial body) appear above the horizon.",
        "(of a fish) come to the surface of water.",
        "Reach a higher position in society or one's profession.",
        "Succeed in not being limited or constrained by (a restrictive environment or situation)",
        "Be superior to.",
        "Get up from lying, sitting, or kneeling.",
        "Get out of bed, especially in the morning.",
        "(of a meeting or a session of a court) adjourn.",
        "Be restored to life.",
        "Cease to be submissive, obedient, or peaceful.",
        "Find the strength or ability to respond adequately to (a challenging situation)",
        "(of a person) react with annoyance or argument to (provocation)",
        "(of a river) have its source.",
        "(of a wind) start to blow or to blow more strongly.",
        "(of land or a natural feature) incline upwards; become higher.",
        "(of a structure or natural feature) be much taller than the surrounding landscape.",
        "(of someone's hair) stand on end.",
        "(of a building) undergo construction from the foundations.",
        "(of dough) swell by the action of yeast.",
        "(of a bump, blister, or weal) appear as a swelling on the skin.",
        "(of a person's stomach) become nauseated.",
        "Increase in number, size, amount, or degree.",
        "(of the sea, a river, or other body of water) increase in level, typically through tidal action or flooding.",
        "(of a barometer or other measuring instrument) give a higher reading.",
        "(of a sound) become louder or higher in pitch.",
        "(of an emotion) develop and become more intense.",
        "(of a person's mood) become more cheerful.",
        "(of the colour in a person's face) become deeper, especially as a result of embarrassment.",
        "Approaching (a specified age)"
    ],
    "parts-of-speech": "Verb"
}