{
    "word": "Roll",
    "definitions": [
        "Move in a particular direction by turning over and over on an axis.",
        "Turn over to face a different direction.",
        "Turn (one's eyes) upwards, typically to show surprise or disapproval.",
        "Lie down and turn over and over while remaining in the same place.",
        "(of a moving ship, aircraft, or vehicle) rock or oscillate round an axis parallel to the direction of motion.",
        "Move along or from side to side unsteadily or uncontrollably.",
        "Overturn (a vehicle)",
        "Throw (a die or dice)",
        "Obtain (a particular score) by throwing a die or dice.",
        "(of a vehicle) move or run on wheels.",
        "Move or push (a wheeled object)",
        "Make a car window or a window blind move up or down by turning a handle.",
        "(of a drop of liquid) flow.",
        "(of time) elapse steadily.",
        "(of a product) issue from (an assembly line or machine)",
        "(of waves, smoke, cloud, or fog) move or flow forward with an undulating motion.",
        "(of land) extend in gentle undulations.",
        "(of credits for a film or television programme) be displayed as if moving on a roller up the screen.",
        "(with reference to a machine, device, or system) operate or begin operating.",
        "Start moving; take action.",
        "Behave in a particular way.",
        "Turn (something flexible) over and over on itself to form a cylinder, tube, or ball.",
        "Fold the edge of a garment over on itself a number of times to shorten it.",
        "Make (something) by forming material into a cylinder or ball.",
        "Curl up tightly.",
        "Flatten (something) by passing a roller over it or by passing it between rollers.",
        "(of a loud, deep sound) reverberate.",
        "Pronounce (a consonant, typically an r) with a trill.",
        "Utter (a word or words) with a reverberating or vibratory effect.",
        "(of words) flow effortlessly or mellifluously.",
        "Rob (someone, typically when they are intoxicated or asleep)"
    ],
    "parts-of-speech": "Verb"
}