{
    "word": "Run",
    "definitions": [
        "An act or spell of running.",
        "A running pace.",
        "An annual mass migration of fish up or down a river.",
        "A journey accomplished or route taken by a vehicle, aircraft, or boat, especially on a regular basis.",
        "A short excursion made in a car.",
        "The distance covered in a specified period, especially by a ship.",
        "A short flight made by an aircraft on a straight and even course at a constant speed before or while dropping bombs.",
        "An opportunity or attempt to achieve something.",
        "A preliminary test of a procedure or system.",
        "An attempt to secure election to political office.",
        "A continuous spell of a particular situation or condition.",
        "A continuous series of performances.",
        "A quantity or amount of something produced at one time.",
        "A continuous stretch or length of something.",
        "A rapid series of musical notes forming a scale.",
        "A sequence of cards of the same suit.",
        "A widespread and sudden demand for (a commodity) or a widespread trading in (a currency)",
        "A sudden demand for repayment from (a bank) made by a large number of lenders.",
        "The average or usual type of person or thing.",
        "The general tendency of something.",
        "A sloping snow-covered course or track used for skiing, bobsleighing, or tobogganing.",
        "A track made or regularly used by a particular animal.",
        "An enclosed area in which domestic animals or birds may run freely in the open.",
        "A large open stretch of land used for pasture or the raising of stock.",
        "Free and unrestricted use of or access to.",
        "A unit of scoring achieved by hitting the ball so that both batsmen are able to run between the wickets, or awarded in some other circumstances.",
        "A point scored by the batter returning to home plate after touching the other bases.",
        "A vertical line of unravelled stitches in stockings or tights; a ladder.",
        "A downward trickle of paint or a similar substance when applied too thickly.",
        "A small stream.",
        "Diarrhoea.",
        "The after part of a ship's bottom where it rises and narrows towards the stern."
    ],
    "parts-of-speech": "Noun"
}